{
  "modelTopology": {
    "keras_version": "2.1.5",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "batch_input_shape": [null, 416, 416, 3],
            "dtype": "float32",
            "filters": 16,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {"name": "leaky_re_lu_1", "alpha": 0.1}
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_2",
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {"name": "leaky_re_lu_2", "alpha": 0.1}
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_2",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_3",
            "filters": 64,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {"name": "leaky_re_lu_3", "alpha": 0.1}
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_3",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_4",
            "filters": 128,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {"name": "leaky_re_lu_4", "alpha": 0.1}
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_4",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_5",
            "filters": 256,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {"name": "leaky_re_lu_5", "alpha": 0.1}
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_5",
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_6",
            "filters": 512,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {"name": "leaky_re_lu_6", "alpha": 0.1}
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_6",
            "pool_size": [2, 2],
            "padding": "same",
            "strides": [1, 1],
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_7",
            "filters": 1024,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {"name": "leaky_re_lu_7", "alpha": 0.1}
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_8",
            "filters": 512,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        },
        {
          "class_name": "LeakyReLU",
          "config": {"name": "leaky_re_lu_8", "alpha": 0.1}
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_9",
            "filters": 425,
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "padding": "same",
            "use_bias": true
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1"],
      "weights": [
        {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"},
        {"name": "conv2d_1/bias", "shape": [16], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group2-shard1of1"],
      "weights": [
        {
          "name": "conv2d_2/kernel",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group3-shard1of1"],
      "weights": [
        {
          "name": "conv2d_3/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group4-shard1of1"],
      "weights": [
        {
          "name": "conv2d_4/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32"
        },
        {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group5-shard1of1"],
      "weights": [
        {
          "name": "conv2d_5/kernel",
          "shape": [3, 3, 128, 256],
          "dtype": "float32"
        },
        {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group6-shard1of2", "group6-shard2of2"],
      "weights": [
        {
          "name": "conv2d_6/kernel",
          "shape": [3, 3, 256, 512],
          "dtype": "float32"
        },
        {"name": "conv2d_6/bias", "shape": [512], "dtype": "float32"}
      ]
    },
    {
      "paths": [
        "group7-shard1of5",
        "group7-shard2of5",
        "group7-shard3of5",
        "group7-shard4of5",
        "group7-shard5of5"
      ],
      "weights": [
        {
          "name": "conv2d_7/kernel",
          "shape": [3, 3, 512, 1024],
          "dtype": "float32"
        },
        {"name": "conv2d_7/bias", "shape": [1024], "dtype": "float32"}
      ]
    },
    {
      "paths": [
        "group8-shard1of5",
        "group8-shard2of5",
        "group8-shard3of5",
        "group8-shard4of5",
        "group8-shard5of5"
      ],
      "weights": [
        {
          "name": "conv2d_8/kernel",
          "shape": [3, 3, 1024, 512],
          "dtype": "float32"
        },
        {"name": "conv2d_8/bias", "shape": [512], "dtype": "float32"}
      ]
    },
    {
      "paths": ["group9-shard1of1"],
      "weights": [
        {
          "name": "conv2d_9/kernel",
          "shape": [1, 1, 512, 425],
          "dtype": "float32"
        },
        {"name": "conv2d_9/bias", "shape": [425], "dtype": "float32"}
      ]
    }
  ]
}